NIC/fourthDay.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-01-01 Mon 20:33 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Day 8</title>
<meta name="author" content="GCES Linux Community" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Day 8</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgbf6bf84">1. Shell</a>
<ul>
<li><a href="#org0f5c68b">1.1. sh (Bourne Shell)</a></li>
<li><a href="#orgc0b40f9">1.2. csh (C Shell)</a></li>
<li><a href="#org21c4344">1.3. Bash (Bourne Again SHell)</a></li>
<li><a href="#org4bee62e">1.4. Zsh (Z Shell)</a></li>
<li><a href="#org4250054">1.5. Fish (Friendly Interactive SHell)</a></li>
<li><a href="#org86f7ab7">1.6. Ksh (KornShell)</a></li>
<li><a href="#org40392ec">1.7. Dash</a></li>
<li><a href="#orge77bc1f">1.8. Tcsh (TENEX C Shell)</a></li>
</ul>
</li>
<li><a href="#orgbc47fae">2. Bash Scripting</a>
<ul>
<li><a href="#org5bb74ef">2.1. Basic Operators</a></li>
<li><a href="#org8a7b669">2.2. Variable</a></li>
<li><a href="#org53b3c2b">2.3. Loop</a></li>
<li><a href="#org2e07122">2.4. Condition</a></li>
<li><a href="#org2f5857d">2.5. Function</a></li>
<li><a href="#orgb2cbf18">2.6. Bash Config file</a></li>
</ul>
</li>
<li><a href="#orgc7cb5a4">3. Cron Tab</a>
<ul>
<li><a href="#orgf3c5558">3.1. Crontab Command:</a></li>
<li><a href="#org048b03a">3.2. Format</a></li>
<li><a href="#org73841b7">3.3. Edit Crontab</a></li>
<li><a href="#org12bd463">3.4. Display Current Crontab entries.</a></li>
<li><a href="#org6c33693">3.5. Remove crontab entry.</a></li>
</ul>
</li>
<li><a href="#orged75939">4. Systemd and Systemctl</a>
<ul>
<li><a href="#org9c92671">4.1. Create a custom service myservice.service</a></li>
<li><a href="#org1d70754">4.2. sudo systemctl start myservice.service</a></li>
<li><a href="#org4ea6c18">4.3. sudo systemctl enable myservice.service</a></li>
<li><a href="#orgeac0ed1">4.4. sudo systemctl status myservice.service</a></li>
<li><a href="#orgcfb8abf">4.5. sudo systemctl restart myservice.serice</a></li>
<li><a href="#orgd828864">4.6. sudo systemctl restart</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgbf6bf84" class="outline-2">
<h2 id="orgbf6bf84"><span class="section-number-2">1.</span> Shell</h2>
<div class="outline-text-2" id="text-1">
<p>
<code>A Linux shell is a command-line interface that allows users to interact with the operating system   kernel by entering commands.It interprets user inputs and executes commands, facilitating communication between the user and the Linux kernel.</code>
</p>
</div>
<div id="outline-container-org0f5c68b" class="outline-3">
<h3 id="org0f5c68b"><span class="section-number-3">1.1.</span> sh (Bourne Shell)</h3>
<div class="outline-text-3" id="text-1-1">
<p>
<code>The Bourne Shell is one of the oldest and simplest Unix shells. It provides a basic set of features and is the ancestor of many other shells, including Bash. While it lacks some of the advanced features found in newer shells, it is lightweight and widely available.</code>
</p>
</div>
</div>

<div id="outline-container-orgc0b40f9" class="outline-3">
<h3 id="orgc0b40f9"><span class="section-number-3">1.2.</span> csh (C Shell)</h3>
<div class="outline-text-3" id="text-1-2">
<p>
<code>The C Shell is another early Unix shell that was developed with a syntax resembling the C programming language. It includes features like command history and job control. However, its scripting capabilities are considered less powerful than those of the Bourne Shell and its successors. "tcsh" (TENEX C Shell) is an extended version of the C Shell with additional features.</code>
</p>
</div>
</div>

<div id="outline-container-org21c4344" class="outline-3">
<h3 id="org21c4344"><span class="section-number-3">1.3.</span> Bash (Bourne Again SHell)</h3>
<div class="outline-text-3" id="text-1-3">
<p>
<code>The default shell for most Linux distributions. It's a powerful and versatile shell with a wide range of features.</code>
</p>
</div>
</div>

<div id="outline-container-org4bee62e" class="outline-3">
<h3 id="org4bee62e"><span class="section-number-3">1.4.</span> Zsh (Z Shell)</h3>
<div class="outline-text-3" id="text-1-4">
<p>
<code>An extended and user-friendly shell that incorporates features from other shells, offering advanced tab completion and theming.</code>
</p>
</div>
</div>

<div id="outline-container-org4250054" class="outline-3">
<h3 id="org4250054"><span class="section-number-3">1.5.</span> Fish (Friendly Interactive SHell)</h3>
<div class="outline-text-3" id="text-1-5">
<p>
<code>Designed to be user-friendly with a focus on simplicity and discoverability. It has syntax highlighting and auto-suggestions.</code>
</p>
</div>
</div>

<div id="outline-container-org86f7ab7" class="outline-3">
<h3 id="org86f7ab7"><span class="section-number-3">1.6.</span> Ksh (KornShell)</h3>
<div class="outline-text-3" id="text-1-6">
<p>
<code>A shell with a rich command and scripting language, offering both interactive and scripting capabilities.</code>
</p>
</div>
</div>

<div id="outline-container-org40392ec" class="outline-3">
<h3 id="org40392ec"><span class="section-number-3">1.7.</span> Dash</h3>
<div class="outline-text-3" id="text-1-7">
<p>
<code>A lightweight and fast shell, often used in system scripts. It aims to be POSIX-compliant and is designed for efficiency.</code>
</p>
</div>
</div>

<div id="outline-container-orge77bc1f" class="outline-3">
<h3 id="orge77bc1f"><span class="section-number-3">1.8.</span> Tcsh (TENEX C Shell)</h3>
<div class="outline-text-3" id="text-1-8">
<p>
<code>An enhanced version of the C shell (csh) with additional features such as command-line editing and job control.</code>
</p>
</div>
</div>
</div>

<div id="outline-container-orgbc47fae" class="outline-2">
<h2 id="orgbc47fae"><span class="section-number-2">2.</span> Bash Scripting</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org5bb74ef" class="outline-3">
<h3 id="org5bb74ef"><span class="section-number-3">2.1.</span> Basic Operators</h3>
<div class="outline-text-3" id="text-2-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Category</th>
<th scope="col" class="org-left">Operators</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Arithmetic Operators</td>
<td class="org-left">+ , -, *, /, %, ++, --</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Comparison Operators</td>
<td class="org-left">​=​= , != , &gt;, &lt;, -ge, -le</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Logical Operators</td>
<td class="org-left">&amp;&amp; (AND),</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">(OR)</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">String Operators</td>
<td class="org-left">= (Assignment), \== (Equality), + (Concatenation)</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">String Manipulation</td>
<td class="org-left">${string:position:length}, ${#string}</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">File Operators</td>
<td class="org-left">-e (Exists), -f (Regular File), -d (Directory), -r (Readable)</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Variable Assignment</td>
<td class="org-left">= (Simple Assignment)</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Command Substitution</td>
<td class="org-left">$(command) or \`command\`</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Grouping</td>
<td class="org-left">( &#x2026; )</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Redirection</td>
<td class="org-left">&gt;, &gt;&gt;, &lt;, \</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Ternary Operator</td>
<td class="org-left">condition ? expr1 : expr2</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org8a7b669" class="outline-3">
<h3 id="org8a7b669"><span class="section-number-3">2.2.</span> Variable</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">
<pre class="src src-bash">#!/bin/bash
greeting="Hello, This is a test."
echo $greeting
</pre>
</div>
</div>
</div>

<div id="outline-container-org53b3c2b" class="outline-3">
<h3 id="org53b3c2b"><span class="section-number-3">2.3.</span> Loop</h3>
<div class="outline-text-3" id="text-2-3">
<div class="org-src-container">
<pre class="src src-bash">#!/bin/bash
for i in {1..10}; do
    echo "Iteration $i"
done
</pre>
</div>
</div>
</div>

<div id="outline-container-org2e07122" class="outline-3">
<h3 id="org2e07122"><span class="section-number-3">2.4.</span> Condition</h3>
<div class="outline-text-3" id="text-2-4">
<div class="org-src-container">
<pre class="src src-bash">#!/bin/bash
number=1
if [ $number -gt 5 ]; then
    echo "The number is greater than 5."
else
    echo "The number is not greater than 5."
fi
</pre>
</div>
</div>
</div>

<div id="outline-container-org2f5857d" class="outline-3">
<h3 id="org2f5857d"><span class="section-number-3">2.5.</span> Function</h3>
<div class="outline-text-3" id="text-2-5">
<div class="org-src-container">
<pre class="src src-bash">#!/bin/bash
multiply_numbers() {
    result=$(( $1 * $2 ))
    echo "Multiplication result: $result"
}
multiply_numbers 3 5
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb2cbf18" class="outline-3">
<h3 id="orgb2cbf18"><span class="section-number-3">2.6.</span> Bash Config file</h3>
<div class="outline-text-3" id="text-2-6">
<p>
The .bashrc file is a script that Bash (Bourne Again SHell) runs whenever it is started interactively. It stands for "Bash Run Commands." The primary purpose of the .bashrc file is to customize the behavior and environment of the Bash shell for a specific user.
</p>
</div>
</div>
</div>

<div id="outline-container-orgc7cb5a4" class="outline-2">
<h2 id="orgc7cb5a4"><span class="section-number-2">3.</span> Cron Tab</h2>
<div class="outline-text-2" id="text-3">
<p>
<code>In Linux and Unix-like operating systems, the cron service is used to schedule tasks to run  automatically at specified intervals. The term "cron" comes from the Greek word "chronos," meaning time.</code>
</p>
</div>
<div id="outline-container-orgf3c5558" class="outline-3">
<h3 id="orgf3c5558"><span class="section-number-3">3.1.</span> Crontab Command:</h3>
<div class="outline-text-3" id="text-3-1">
<p>
<code>The crontab command is used to create, edit, and manage cron jobs for a user. Each user can have their own crontab, and these are stored in the /var/spool/cron directory.</code>
</p>
</div>
</div>
<div id="outline-container-org048b03a" class="outline-3">
<h3 id="org048b03a"><span class="section-number-3">3.2.</span> Format</h3>
<div class="outline-text-3" id="text-3-2">
<p>
<code>minute hour day month day_of_week command_to_run</code>
Example: Cron entry that runs a script every day at 3:30 PM
	<code>30 15 * * * /path/to/script.sh</code>
Example: Cron entry that runs every 1 hour.
	<code>0 * * * *</code> <code>/path/to/script.sh</code>
Example: Cron entry that runs every 1 minute.
	<code>* * * * *</code> <code>/path/to/script.sh</code>
</p>
</div>
</div>

<div id="outline-container-org73841b7" class="outline-3">
<h3 id="org73841b7"><span class="section-number-3">3.3.</span> Edit Crontab</h3>
<div class="outline-text-3" id="text-3-3">
<p>
<code>crontab -e</code>
</p>
</div>
</div>
<div id="outline-container-org12bd463" class="outline-3">
<h3 id="org12bd463"><span class="section-number-3">3.4.</span> Display Current Crontab entries.</h3>
<div class="outline-text-3" id="text-3-4">
<p>
<code>crontab -l</code>
</p>
</div>
</div>
<div id="outline-container-org6c33693" class="outline-3">
<h3 id="org6c33693"><span class="section-number-3">3.5.</span> Remove crontab entry.</h3>
<div class="outline-text-3" id="text-3-5">
<p>
<code>crontab -r</code>
</p>
</div>
</div>
</div>






<div id="outline-container-orged75939" class="outline-2">
<h2 id="orged75939"><span class="section-number-2">4.</span> Systemd and Systemctl</h2>
<div class="outline-text-2" id="text-4">
<p>
<code>systemd</code> is a system and service manager for Linux operating systems. It is responsible for initializing and managing the system components, services, and processes. <code>systemctl</code> is a command-line utility that serves as an interface to control and query the systemd system and service manager.
</p>
</div>
<div id="outline-container-org9c92671" class="outline-3">
<h3 id="org9c92671"><span class="section-number-3">4.1.</span> Create a custom service myservice.service</h3>
<div class="outline-text-3" id="text-4-1">
<p>
<code>sudo vim /etc/systemd/system/myservice.service</code>
</p>
<div class="org-src-container">
<pre class="src src-ini">[Unit]
Description=My Service
[Service]
Type=simple
ExecStart=/bin/bash /home/spd/script.bash
Restart=always
RestartSec=5
[Install]
WantedBy=default.target
</pre>
</div>
</div>
</div>
<div id="outline-container-org1d70754" class="outline-3">
<h3 id="org1d70754"><span class="section-number-3">4.2.</span> sudo systemctl start myservice.service</h3>
</div>
<div id="outline-container-org4ea6c18" class="outline-3">
<h3 id="org4ea6c18"><span class="section-number-3">4.3.</span> sudo systemctl enable myservice.service</h3>
</div>
<div id="outline-container-orgeac0ed1" class="outline-3">
<h3 id="orgeac0ed1"><span class="section-number-3">4.4.</span> sudo systemctl status myservice.service</h3>
</div>
<div id="outline-container-orgcfb8abf" class="outline-3">
<h3 id="orgcfb8abf"><span class="section-number-3">4.5.</span> sudo systemctl restart myservice.serice</h3>
</div>
<div id="outline-container-orgd828864" class="outline-3">
<h3 id="orgd828864"><span class="section-number-3">4.6.</span> sudo systemctl restart</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2024-01-01 Mon</p>
<p class="author">Author: GCES Linux Community</p>
<p class="date">Created: 2024-01-01 Mon 20:33</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>